src/test/resources/nl/clockwork/ebms/soap/InsertCPA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.ordina.nl/cpa/2.18">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:insertCPA>
         <cpa><![CDATA[[(${cpa})]]]></cpa>
         <overwrite>[[${overwrite}]]</overwrite>
      </ns:insertCPA>
   </soapenv:Body>
</soapenv:Envelope>